Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm Constructor (List<RebarItem>)
 Creates a new instance of the ReinforcementSelectionForm.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementSelectionForm(
	List<RebarItem> RebarList
)
Public Sub New (
	RebarList As List(Of RebarItem)
)
Parameters
RebarList
Type: System.Collections.Generic.List<RebarItem>
A list with the rebars that will be added to the tree.
See Also
Reference
ReinforcementSelectionForm Class
ReinforcementSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace